Белгипрозем_2017/src/Catalogs/мДокументыЗаказчика/мДокументыЗаказчика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мДокументыЗаказчика</name>
  <owners>Catalog.мЭтапыДоговоров</owners>
  <attributes>
    <name>ДокументЗаказчика</name>
    <type>
      <types>CatalogRef.мПакетыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязательный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПунктыДокумента</name>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имеется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/мДокументыЗаказчика/ManagerModule.bsl
// <Описание функции>
//
// Параметры
//  <ИсходныйДокумент>  - <Справочник.ПакетыДокументов> - элемент
//  <Владелец>  - <Справочник.мЭтапыДоговоров>
//
// Возвращаемое значение:
//   <Справочник.мДокументыЗаказчика> - ссылка на элемент
//
Функция СоздатьДокументЗаказчика(ИсходныйДокумент, Владелец) Экспорт
	
	НовыйЭл = Справочники.мДокументыЗаказчика.СоздатьЭлемент();
	НовыйЭл.Владелец = Владелец;
	НовыйЭл.ДокументЗаказчика = ИсходныйДокумент;
	НовыйЭл.Наименование = ИсходныйДокумент.Наименование;
	НовыйЭл.Обязательный = ИсходныйДокумент.Обязательный;
	Для каждого ПунктИсхДок Из ИсходныйДокумент.ПунктыДокумента Цикл
		НовПункт = НовыйЭл.ПунктыДокумента.Добавить();
		НовПункт.Пункт = ПунктИсхДок.Пункт;
	КонецЦикла; 
    НовыйЭл.Записать();
	
	Возврат НовыйЭл.Ссылка;
	
КонецФункции // СоздатьДокументЗаказчика(ИсходныйДокумент, Владелец)
